       01  ARQ-DADOS.
           05 ARQ-RM            PIC X(04).
           05 ARQ-NOMEALUNO     PIC X(20).
           05 ARQ-CURSO         PIC X(15).
           05 ARQ-SEMESTRE      PIC X(02).
           05 ARQ-MENSALIDADE   PIC 9(06).
