       IDENTIFICATION                                          DIVISION.
       PROGRAM-ID. PROGVERI.
      *-------------------------------------------------
      *---- SOBRE O MODULO
      *----
      *--- AUTOR    : ALEXANDRE
      *--- EMPRESA  : XPTO
      *--- DATA     : 13/04/2024
      *--- OBJETIVOS: VERIFICA SE NAO EXISTE DUPLICIDADE NOS REGISTROS
      *---------------------------------------------------
      *---------------------------------------------------
      *---- DEFINICAO DE ARQUIVOS
      *----
      *---- ARQUIVO        TIPO I/O         BOOK
      *---- ALUNOS            I             BOKALU
      *----
      *---------------------------------------------------

      *-----------------------------------------------------------------
       ENVIRONMENT                                             DIVISION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       CONFIGURATION                                           SECTION.
      *-----------------------------------------------------------------
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      *-----------------------------------------------------------------
       INPUT-OUTPUT                                            SECTION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       FILE-CONTROL.
      *-----------------------------------------------------------------
*           SELECT ALUNOS  ASSIGN TO
                      "C:\CURSOLOGICA\COBOL\Projeto FINAL\ALUNOS.dat"
                  FILE STATUS IS FS-ALUNOS.

      *-----------------------------------------------------------------
       DATA                                                    DIVISION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       FILE                                                    SECTION.
      *-----------------------------------------------------------------

       FD  ALUNOS.
       COPY "BOKALU".

      *-----------------------------------------------------------------
       WORKING-STORAGE                                         SECTION.
      *-----------------------------------------------------------------

      *------------- VARIAVEIS DE STATUS
       77  FS-ALUNOS                    PIC 9(02).
       77  WRK-SEGURA                   PIC X(01).

      *-----------------------------------------------------------------
       LINKAGE                                                  SECTION.
      *-----------------------------------------------------------------

       01  LNK-RM                    PIC X(04).
       01  LNK-VERIFICA              PIC 9(01).

      *-----------------------------------------------------------------
       PROCEDURE                                                DIVISION
       USING LNK-RM, LNK-VERIFICA.
      *-----------------------------------------------------------------

       0001-PRINCIPAL                          SECTION.

            PERFORM 0100-INICIALIZAR.
            PERFORM 0200-PROCESSAR.
            PERFORM 0300-FINALIZAR.
            GOBACK.

      *-----------------------------------------------------------------
       0100-INICIALIZAR                                        SECTION.
      *-----------------------------------------------------------------

      *----------------- AREA DE ABERTURA DE ARQUIVOS ------------------
           OPEN INPUT ALUNOS.

           IF  FS-ALUNOS NOT EQUAL ZEROS
               CLOSE ALUNOS
               GOBACK
           END-IF.

      *-----------------------------------------------------------------
       0100-INICIALIZAR-99-FIM                                 SECTION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       0200-PROCESSAR                                          SECTION.
      *-----------------------------------------------------------------
      *-------------------- AREA DE LEITURA ----------------------------
           MOVE 0                             TO  LNK-VERIFICA
           READ ALUNOS.

           PERFORM UNTIL FS-ALUNOS NOT EQUAL ZEROS
              IF LNK-RM  EQUAL ARQ-RM
                 MOVE 1                       TO  LNK-VERIFICA

              END-IF
           READ ALUNOS
           END-PERFORM.

      *-----------------------------------------------------------------
       0200-PROCESSAR-99-FIM                                   SECTION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       0300-FINALIZAR                                          SECTION.
      *-----------------------------------------------------------------

      *--------------------- AREA DE FECHAMENTO DE ARQUIVOS ------------

           CLOSE ALUNOS.

      *-----------------------------------------------------------------
       0300-FINALIZAR-99-FIM                                   SECTION.
      *-----------------------------------------------------------------
